aehoppe/E70N19_Dev_Board/atsame70n19/include/component/pio.h
/* -------- PIO_IDR : (PIO Offset: 0x44) (/W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  Input Change Interrupt Disable           */
    uint32_t P1:1;                      /**< bit:      1  Input Change Interrupt Disable           */
    uint32_t P2:1;                      /**< bit:      2  Input Change Interrupt Disable           */
    uint32_t P3:1;                      /**< bit:      3  Input Change Interrupt Disable           */
    uint32_t P4:1;                      /**< bit:      4  Input Change Interrupt Disable           */
    uint32_t P5:1;                      /**< bit:      5  Input Change Interrupt Disable           */
    uint32_t P6:1;                      /**< bit:      6  Input Change Interrupt Disable           */
    uint32_t P7:1;                      /**< bit:      7  Input Change Interrupt Disable           */
    uint32_t P8:1;                      /**< bit:      8  Input Change Interrupt Disable           */
    uint32_t P9:1;                      /**< bit:      9  Input Change Interrupt Disable           */
    uint32_t P10:1;                     /**< bit:     10  Input Change Interrupt Disable           */
    uint32_t P11:1;                     /**< bit:     11  Input Change Interrupt Disable           */
    uint32_t P12:1;                     /**< bit:     12  Input Change Interrupt Disable           */
    uint32_t P13:1;                     /**< bit:     13  Input Change Interrupt Disable           */
    uint32_t P14:1;                     /**< bit:     14  Input Change Interrupt Disable           */
    uint32_t P15:1;                     /**< bit:     15  Input Change Interrupt Disable           */
    uint32_t P16:1;                     /**< bit:     16  Input Change Interrupt Disable           */
    uint32_t P17:1;                     /**< bit:     17  Input Change Interrupt Disable           */
    uint32_t P18:1;                     /**< bit:     18  Input Change Interrupt Disable           */
    uint32_t P19:1;                     /**< bit:     19  Input Change Interrupt Disable           */
    uint32_t P20:1;                     /**< bit:     20  Input Change Interrupt Disable           */
    uint32_t P21:1;                     /**< bit:     21  Input Change Interrupt Disable           */
    uint32_t P22:1;                     /**< bit:     22  Input Change Interrupt Disable           */
    uint32_t P23:1;                     /**< bit:     23  Input Change Interrupt Disable           */
    uint32_t P24:1;                     /**< bit:     24  Input Change Interrupt Disable           */
    uint32_t P25:1;                     /**< bit:     25  Input Change Interrupt Disable           */
    uint32_t P26:1;                     /**< bit:     26  Input Change Interrupt Disable           */
    uint32_t P27:1;                     /**< bit:     27  Input Change Interrupt Disable           */
    uint32_t P28:1;                     /**< bit:     28  Input Change Interrupt Disable           */
    uint32_t P29:1;                     /**< bit:     29  Input Change Interrupt Disable           */
    uint32_t P30:1;                     /**< bit:     30  Input Change Interrupt Disable           */
    uint32_t P31:1;                     /**< bit:     31  Input Change Interrupt Disable           */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  Input Change Interrupt Disable           */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_IDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_IDR_OFFSET                      (0x44)                                        /**<  (PIO_IDR) Interrupt Disable Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PIO_IDR_P0_Pos                      0                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P0_Msk                      (0x1U << PIO_IDR_P0_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P0                          PIO_IDR_P0_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P0_Msk instead */
#define PIO_IDR_P1_Pos                      1                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P1_Msk                      (0x1U << PIO_IDR_P1_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P1                          PIO_IDR_P1_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P1_Msk instead */
#define PIO_IDR_P2_Pos                      2                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P2_Msk                      (0x1U << PIO_IDR_P2_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P2                          PIO_IDR_P2_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P2_Msk instead */
#define PIO_IDR_P3_Pos                      3                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P3_Msk                      (0x1U << PIO_IDR_P3_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P3                          PIO_IDR_P3_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P3_Msk instead */
#define PIO_IDR_P4_Pos                      4                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P4_Msk                      (0x1U << PIO_IDR_P4_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P4                          PIO_IDR_P4_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P4_Msk instead */
#define PIO_IDR_P5_Pos                      5                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P5_Msk                      (0x1U << PIO_IDR_P5_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P5                          PIO_IDR_P5_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P5_Msk instead */
#define PIO_IDR_P6_Pos                      6                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P6_Msk                      (0x1U << PIO_IDR_P6_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P6                          PIO_IDR_P6_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P6_Msk instead */
#define PIO_IDR_P7_Pos                      7                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P7_Msk                      (0x1U << PIO_IDR_P7_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P7                          PIO_IDR_P7_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P7_Msk instead */
#define PIO_IDR_P8_Pos                      8                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P8_Msk                      (0x1U << PIO_IDR_P8_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P8                          PIO_IDR_P8_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P8_Msk instead */
#define PIO_IDR_P9_Pos                      9                                              /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P9_Msk                      (0x1U << PIO_IDR_P9_Pos)                       /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P9                          PIO_IDR_P9_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P9_Msk instead */
#define PIO_IDR_P10_Pos                     10                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P10_Msk                     (0x1U << PIO_IDR_P10_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P10                         PIO_IDR_P10_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P10_Msk instead */
#define PIO_IDR_P11_Pos                     11                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P11_Msk                     (0x1U << PIO_IDR_P11_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P11                         PIO_IDR_P11_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P11_Msk instead */
#define PIO_IDR_P12_Pos                     12                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P12_Msk                     (0x1U << PIO_IDR_P12_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P12                         PIO_IDR_P12_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P12_Msk instead */
#define PIO_IDR_P13_Pos                     13                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P13_Msk                     (0x1U << PIO_IDR_P13_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P13                         PIO_IDR_P13_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P13_Msk instead */
#define PIO_IDR_P14_Pos                     14                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P14_Msk                     (0x1U << PIO_IDR_P14_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P14                         PIO_IDR_P14_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P14_Msk instead */
#define PIO_IDR_P15_Pos                     15                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P15_Msk                     (0x1U << PIO_IDR_P15_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P15                         PIO_IDR_P15_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P15_Msk instead */
#define PIO_IDR_P16_Pos                     16                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P16_Msk                     (0x1U << PIO_IDR_P16_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P16                         PIO_IDR_P16_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P16_Msk instead */
#define PIO_IDR_P17_Pos                     17                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P17_Msk                     (0x1U << PIO_IDR_P17_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P17                         PIO_IDR_P17_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P17_Msk instead */
#define PIO_IDR_P18_Pos                     18                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P18_Msk                     (0x1U << PIO_IDR_P18_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P18                         PIO_IDR_P18_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P18_Msk instead */
#define PIO_IDR_P19_Pos                     19                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P19_Msk                     (0x1U << PIO_IDR_P19_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P19                         PIO_IDR_P19_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P19_Msk instead */
#define PIO_IDR_P20_Pos                     20                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P20_Msk                     (0x1U << PIO_IDR_P20_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P20                         PIO_IDR_P20_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P20_Msk instead */
#define PIO_IDR_P21_Pos                     21                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P21_Msk                     (0x1U << PIO_IDR_P21_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P21                         PIO_IDR_P21_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P21_Msk instead */
#define PIO_IDR_P22_Pos                     22                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P22_Msk                     (0x1U << PIO_IDR_P22_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P22                         PIO_IDR_P22_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P22_Msk instead */
#define PIO_IDR_P23_Pos                     23                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P23_Msk                     (0x1U << PIO_IDR_P23_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P23                         PIO_IDR_P23_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P23_Msk instead */
#define PIO_IDR_P24_Pos                     24                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P24_Msk                     (0x1U << PIO_IDR_P24_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P24                         PIO_IDR_P24_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P24_Msk instead */
#define PIO_IDR_P25_Pos                     25                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P25_Msk                     (0x1U << PIO_IDR_P25_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P25                         PIO_IDR_P25_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P25_Msk instead */
#define PIO_IDR_P26_Pos                     26                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P26_Msk                     (0x1U << PIO_IDR_P26_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P26                         PIO_IDR_P26_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P26_Msk instead */
#define PIO_IDR_P27_Pos                     27                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P27_Msk                     (0x1U << PIO_IDR_P27_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P27                         PIO_IDR_P27_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P27_Msk instead */
#define PIO_IDR_P28_Pos                     28                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P28_Msk                     (0x1U << PIO_IDR_P28_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P28                         PIO_IDR_P28_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P28_Msk instead */
#define PIO_IDR_P29_Pos                     29                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P29_Msk                     (0x1U << PIO_IDR_P29_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P29                         PIO_IDR_P29_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P29_Msk instead */
#define PIO_IDR_P30_Pos                     30                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P30_Msk                     (0x1U << PIO_IDR_P30_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P30                         PIO_IDR_P30_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P30_Msk instead */
#define PIO_IDR_P31_Pos                     31                                             /**< (PIO_IDR) Input Change Interrupt Disable Position */
#define PIO_IDR_P31_Msk                     (0x1U << PIO_IDR_P31_Pos)                      /**< (PIO_IDR) Input Change Interrupt Disable Mask */
#define PIO_IDR_P31                         PIO_IDR_P31_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IDR_P31_Msk instead */
#define PIO_IDR_P_Pos                       0                                              /**< (PIO_IDR Position) Input Change Interrupt Disable */
#define PIO_IDR_P_Msk                       (0xFFFFFFFFU << PIO_IDR_P_Pos)                 /**< (PIO_IDR Mask) P */
#define PIO_IDR_P(value)                    (PIO_IDR_P_Msk & ((value) << PIO_IDR_P_Pos))   
#define PIO_IDR_MASK                        (0xFFFFFFFFU)                                  /**< \deprecated (PIO_IDR) Register MASK  (Use PIO_IDR_Msk instead)  */
#define PIO_IDR_Msk                         (0xFFFFFFFFU)                                  /**< (PIO_IDR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


