aehoppe/E70N19_Dev_Board/atsame70n19/include/component/pio.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_PPDSR_OFFSET                    (0x98)                                        /**<  (PIO_PPDSR) Pad Pull-down Status Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define PIO_PPDSR_P0_Pos                    0                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P0_Msk                    (0x1U << PIO_PPDSR_P0_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P0                        PIO_PPDSR_P0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P0_Msk instead */
#define PIO_PPDSR_P1_Pos                    1                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P1_Msk                    (0x1U << PIO_PPDSR_P1_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P1                        PIO_PPDSR_P1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P1_Msk instead */
#define PIO_PPDSR_P2_Pos                    2                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P2_Msk                    (0x1U << PIO_PPDSR_P2_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P2                        PIO_PPDSR_P2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P2_Msk instead */
#define PIO_PPDSR_P3_Pos                    3                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P3_Msk                    (0x1U << PIO_PPDSR_P3_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P3                        PIO_PPDSR_P3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P3_Msk instead */
#define PIO_PPDSR_P4_Pos                    4                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P4_Msk                    (0x1U << PIO_PPDSR_P4_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P4                        PIO_PPDSR_P4_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P4_Msk instead */
#define PIO_PPDSR_P5_Pos                    5                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P5_Msk                    (0x1U << PIO_PPDSR_P5_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P5                        PIO_PPDSR_P5_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P5_Msk instead */
#define PIO_PPDSR_P6_Pos                    6                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P6_Msk                    (0x1U << PIO_PPDSR_P6_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P6                        PIO_PPDSR_P6_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P6_Msk instead */
#define PIO_PPDSR_P7_Pos                    7                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P7_Msk                    (0x1U << PIO_PPDSR_P7_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P7                        PIO_PPDSR_P7_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P7_Msk instead */
#define PIO_PPDSR_P8_Pos                    8                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P8_Msk                    (0x1U << PIO_PPDSR_P8_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P8                        PIO_PPDSR_P8_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P8_Msk instead */
#define PIO_PPDSR_P9_Pos                    9                                              /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P9_Msk                    (0x1U << PIO_PPDSR_P9_Pos)                     /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P9                        PIO_PPDSR_P9_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P9_Msk instead */
#define PIO_PPDSR_P10_Pos                   10                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P10_Msk                   (0x1U << PIO_PPDSR_P10_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P10                       PIO_PPDSR_P10_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P10_Msk instead */
#define PIO_PPDSR_P11_Pos                   11                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P11_Msk                   (0x1U << PIO_PPDSR_P11_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P11                       PIO_PPDSR_P11_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P11_Msk instead */
#define PIO_PPDSR_P12_Pos                   12                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P12_Msk                   (0x1U << PIO_PPDSR_P12_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P12                       PIO_PPDSR_P12_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P12_Msk instead */
#define PIO_PPDSR_P13_Pos                   13                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P13_Msk                   (0x1U << PIO_PPDSR_P13_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P13                       PIO_PPDSR_P13_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P13_Msk instead */
#define PIO_PPDSR_P14_Pos                   14                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P14_Msk                   (0x1U << PIO_PPDSR_P14_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P14                       PIO_PPDSR_P14_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P14_Msk instead */
#define PIO_PPDSR_P15_Pos                   15                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P15_Msk                   (0x1U << PIO_PPDSR_P15_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P15                       PIO_PPDSR_P15_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P15_Msk instead */
#define PIO_PPDSR_P16_Pos                   16                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P16_Msk                   (0x1U << PIO_PPDSR_P16_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P16                       PIO_PPDSR_P16_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P16_Msk instead */
#define PIO_PPDSR_P17_Pos                   17                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P17_Msk                   (0x1U << PIO_PPDSR_P17_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P17                       PIO_PPDSR_P17_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P17_Msk instead */
#define PIO_PPDSR_P18_Pos                   18                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P18_Msk                   (0x1U << PIO_PPDSR_P18_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P18                       PIO_PPDSR_P18_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P18_Msk instead */
#define PIO_PPDSR_P19_Pos                   19                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P19_Msk                   (0x1U << PIO_PPDSR_P19_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P19                       PIO_PPDSR_P19_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P19_Msk instead */
#define PIO_PPDSR_P20_Pos                   20                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P20_Msk                   (0x1U << PIO_PPDSR_P20_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P20                       PIO_PPDSR_P20_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P20_Msk instead */
#define PIO_PPDSR_P21_Pos                   21                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P21_Msk                   (0x1U << PIO_PPDSR_P21_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P21                       PIO_PPDSR_P21_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P21_Msk instead */
#define PIO_PPDSR_P22_Pos                   22                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P22_Msk                   (0x1U << PIO_PPDSR_P22_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P22                       PIO_PPDSR_P22_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P22_Msk instead */
#define PIO_PPDSR_P23_Pos                   23                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P23_Msk                   (0x1U << PIO_PPDSR_P23_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P23                       PIO_PPDSR_P23_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P23_Msk instead */
#define PIO_PPDSR_P24_Pos                   24                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P24_Msk                   (0x1U << PIO_PPDSR_P24_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P24                       PIO_PPDSR_P24_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P24_Msk instead */
#define PIO_PPDSR_P25_Pos                   25                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P25_Msk                   (0x1U << PIO_PPDSR_P25_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P25                       PIO_PPDSR_P25_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P25_Msk instead */
#define PIO_PPDSR_P26_Pos                   26                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P26_Msk                   (0x1U << PIO_PPDSR_P26_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P26                       PIO_PPDSR_P26_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P26_Msk instead */
#define PIO_PPDSR_P27_Pos                   27                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P27_Msk                   (0x1U << PIO_PPDSR_P27_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P27                       PIO_PPDSR_P27_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P27_Msk instead */
#define PIO_PPDSR_P28_Pos                   28                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P28_Msk                   (0x1U << PIO_PPDSR_P28_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P28                       PIO_PPDSR_P28_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P28_Msk instead */
#define PIO_PPDSR_P29_Pos                   29                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P29_Msk                   (0x1U << PIO_PPDSR_P29_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P29                       PIO_PPDSR_P29_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P29_Msk instead */
#define PIO_PPDSR_P30_Pos                   30                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P30_Msk                   (0x1U << PIO_PPDSR_P30_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P30                       PIO_PPDSR_P30_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P30_Msk instead */
#define PIO_PPDSR_P31_Pos                   31                                             /**< (PIO_PPDSR) Pull-Down Status Position */
#define PIO_PPDSR_P31_Msk                   (0x1U << PIO_PPDSR_P31_Pos)                    /**< (PIO_PPDSR) Pull-Down Status Mask */
#define PIO_PPDSR_P31                       PIO_PPDSR_P31_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PPDSR_P31_Msk instead */
#define PIO_PPDSR_P_Pos                     0                                              /**< (PIO_PPDSR Position) Pull-Down Status */
#define PIO_PPDSR_P_Msk                     (0xFFFFFFFFU << PIO_PPDSR_P_Pos)               /**< (PIO_PPDSR Mask) P */
#define PIO_PPDSR_P(value)                  (PIO_PPDSR_P_Msk & ((value) << PIO_PPDSR_P_Pos))  
#define PIO_PPDSR_MASK                      (0xFFFFFFFFU)                                  /**< \deprecated (PIO_PPDSR) Register MASK  (Use PIO_PPDSR_Msk instead)  */
#define PIO_PPDSR_Msk                       (0xFFFFFFFFU)                                  /**< (PIO_PPDSR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


